NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/lpn.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "mesh_lpn.h"
#include "mesh_friendship_types.h"
#include "mesh_lpn_internal.h"

#include "fsm.h"
#include "fsm_assistant.h"
#include "bearer_event.h"
#include "scanner.h"
#include "transport.h"
#include "packet_mesh.h"
#include "timer.h"
#include "timer_scheduler.h"
#include "utils.h"
#include "event.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_defines.h"
#include "nrf_mesh_externs.h"
#include "nrf_mesh_keygen.h"
#include "nordic_common.h"

#if MESH_FEATURE_LPN_ENABLED

/**************************************************************************************************/

#define TIMER_JITTER_US (280)

#define FRIEND_REQUEST_RSSI_FACTOR_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_rssi_factor_set(PKT, VAL)
#define FRIEND_REQUEST_RX_WINDOW_FACTOR_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_receive_window_factor_set(PKT, VAL)
#define FRIEND_REQUEST_MIN_QUEUE_SIZE_LOG_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_min_queue_size_log_set(PKT, VAL)
#define FRIEND_REQUEST_RX_DELAY_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_receive_delay_set(PKT, VAL)
#define FRIEND_REQUEST_RX_DELAY_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_receive_delay_set(PKT, VAL)
#define FRIEND_REQUEST_POLL_TIMEOUT_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_poll_timeout_set(PKT, VAL)
#define FRIEND_REQUEST_PREVIOUS_ADDRESS_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_previous_address_set(PKT, VAL)
#define FRIEND_REQUEST_NUM_ELEMENTS_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_num_elements_set(PKT, VAL)
#define FRIEND_REQUEST_LPN_COUNTER_PACK(PKT, VAL) packet_mesh_trs_control_friend_request_lpn_counter_set(PKT, VAL)

#define FRIEND_POLL_FSN_PACK(PKT, VAL) packet_mesh_trs_control_friend_poll_fsn_set(PKT, VAL)

#define FRIEND_CLEAR_LPN_ADDRESS_PACK(PKT, VAL) packet_mesh_trs_control_friend_clear_lpn_address_set(PKT, VAL)
#define FRIEND_CLEAR_LPN_COUNTER_PACK(PKT, VAL) packet_mesh_trs_control_friend_clear_lpn_counter_set(PKT, VAL)

#define FRIEND_OFFER_RX_WINDOW_UNPACK(PKT) packet_mesh_trs_control_friend_offer_receive_window_get(PKT)
#define FRIEND_OFFER_QUEUE_SIZE_UNPACK(PKT) packet_mesh_trs_control_friend_offer_queue_size_get(PKT)
#define FRIEND_OFFER_SUBLIST_SIZE_UNPACK(PKT) packet_mesh_trs_control_friend_offer_subscription_list_size_get(PKT)
#define FRIEND_OFFER_RSSI_UNPACK(PKT) packet_mesh_trs_control_friend_offer_rssi_get(PKT)
#define FRIEND_OFFER_FRIEND_COUNTER_UNPACK(PKT) packet_mesh_trs_control_friend_offer_friend_counter_get(PKT)

#define FRIEND_UPDATE_KEY_REFRESH_FLAG_UNPACK(PKT) packet_mesh_trs_control_friend_update_key_refresh_flag_get(PKT)
#define FRIEND_UPDATE_IV_UPDATE_FLAG_UNPACK(PKT) packet_mesh_trs_control_friend_update_iv_update_flag_get(PKT)
#define FRIEND_UPDATE_IV_INDEX_UNPACK(PKT) packet_mesh_trs_control_friend_update_iv_index_get(PKT)
#define FRIEND_UPDATE_MD_UNPACK(PKT) packet_mesh_trs_control_friend_update_md_get(PKT)

/*lint -e123 */
#define EVENT_LIST  E_ESTABLISH,             \
                    E_TIMEOUT,               \
                    E_FRIEND_OFFER_RX,       \
                    E_FRIEND_UPDATE_RX,      \
                    E_POLL,                  \
                    E_NETWORK_RX,            \
                    E_TERMINATE,             \
                    E_OFFER_ACCEPT,          \
                    E_INTERNAL_FAULT

#define STATE_LIST  S_IDLE,                  \
                    S_ESTABLISHMENT,         \
                    S_POLLING,               \
                    S_SLEEP

#define ACTION_LIST A_FRIEND_REQUEST_SEND,           a_friend_request_send,   \
                    A_FRIEND_POLL_SEND,              a_friend_poll_send,      \
                    A_FRIEND_CLEAR_SEND,             a_friend_clear_send,     \
                    A_SUBMAN_DATA_SEND,              a_subman_data_send,      \
                    A_FRIEND_SEARCH_FINISHED_NOTIFY, a_friend_search_finished_notify, \
                    A_FRIENDSHIP_ESTABLISHED_NOTIFY, a_friendship_established_notify, \
                    A_POLLING_TERMINATED_NOTIFY,     a_polling_terminated_notify,     \
                    A_POLLING_FINISHED_NOTIFY,       a_polling_finished_notify,       \
                    A_OFFER_RECEIVED_NOTIFY,         a_offer_received_notify,         \
                    A_POLL_SCHEDULE,                 a_poll_schedule,                 \
                    A_FAULT_NOTIFY,                  a_fault_notify

#define GUARD_LIST  G_IS_LAST_FRNDREQ,       g_is_last_frndreq,       \
                    G_IS_LAST_ATTEMPT,       g_is_last_attempt,       \
                    G_IS_NOT_ESTABLISHED,    g_is_not_established,    \
                    G_IS_NO_MORE_DATA,       g_is_no_more_data,       \
                    G_IS_SUBMAN_DATA,        g_is_subman_data,        \
                    G_IS_OFFER_SUITABLE,     g_is_offer_suitable

