NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/lpn.c
typedef enum
{
    DECLARE_ENUM(EVENT_LIST)
} lpn_event_ids_t;

typedef enum
{
    DECLARE_ENUM(STATE_LIST)
} lpn_state_ids_t;

typedef enum
{
    DECLARE_ENUM_PAIR(ACTION_LIST)
} lpn_action_ids_t;

typedef enum
{
    DECLARE_ENUM_PAIR(GUARD_LIST)
} lpn_guard_ids_t;

typedef union
{
    struct
    {
        const transport_control_packet_t * p_control_packet;
        const nrf_mesh_rx_metadata_t * p_rx_metadata;
    } incoming_cmd;
    struct
    {
        uint32_t delay_ms;
    } poll_scheduler;
} fsm_transac_data_t;

typedef void (* lpn_internal_task_t)(void);

typedef struct
{
    bool                is_in_friendship;
    lpn_internal_task_t task;
    bearer_event_flag_t lpn_be_flag;
    uint32_t            poll_interval_ms;
    uint32_t            poll_timeout_ms;
    uint32_t            receive_delay_ms;
    uint32_t            request_timeout_ms;
    uint32_t            receive_window_ms;
    uint32_t            delay_ms;
    friend_criteria_t   criteria;
    uint8_t             subscription_list_size;
    uint16_t            lpn_counter;
    uint16_t            friend_address;
    uint8_t             fsn;
    uint8_t             poll_attempts_count;
    uint8_t             frndreq_attempts_count;
    timer_event_t       timeout_scheduler;
    transport_control_packet_t * p_subman_data;
} lpn_t;

typedef void (* lpn_fsm_action_t)(void *);
typedef bool (* lpn_fsm_guard_t)(void *);

/* Not having a semi-colon is intentional. */
DECLARE_ACTION_PROTOTYPE(ACTION_LIST)
DECLARE_GUARD_PROTOTYPE(GUARD_LIST)

static void lpn_fsm_action(fsm_action_id_t action_id, void * p_data);
static bool lpn_fsm_guard(fsm_action_id_t action_id, void * p_data);
static void lpn_fault_task_post(void);
static void receive_delay_handle(timestamp_t timestamp, void * p_context);
static void timeout_handle(timestamp_t timestamp, void * p_context);
static void friend_offer_handle(const transport_control_packet_t * p_control_packet,
                                const nrf_mesh_rx_metadata_t * p_rx_metadata);
static void friend_update_handle(const transport_control_packet_t * p_control_packet,
                                 const nrf_mesh_rx_metadata_t * p_rx_metadata);
static void termination_evt_prepare(nrf_mesh_evt_t * p_evt,
                                    nrf_mesh_evt_friendship_terminated_reason_t reason);
static void transmit_and_reschedule(const transport_control_packet_t * p_packet,
                                    nrf_mesh_tx_token_t token,
                                    uint32_t receive_delay_ms,
                                    uint32_t receive_window_ms);

static const fsm_transition_t m_lpn_fsm_transition_table[] =
{
    FSM_STATE(S_IDLE),
    FSM_TRANSITION(E_ESTABLISH,        FSM_ALWAYS,           A_FRIEND_REQUEST_SEND,     S_ESTABLISHMENT),

    FSM_STATE(S_ESTABLISHMENT),
    FSM_TRANSITION(E_TIMEOUT,          G_IS_LAST_FRNDREQ,    A_FRIEND_SEARCH_FINISHED_NOTIFY, S_IDLE),
    FSM_TRANSITION(E_TIMEOUT,          FSM_OTHERWISE,        A_FRIEND_REQUEST_SEND,     FSM_SAME_STATE),
    FSM_TRANSITION(E_FRIEND_OFFER_RX,  G_IS_OFFER_SUITABLE,  A_OFFER_RECEIVED_NOTIFY,   FSM_SAME_STATE),
    FSM_TRANSITION(E_OFFER_ACCEPT,     FSM_ALWAYS,           A_FRIEND_POLL_SEND,        S_POLLING),

    FSM_STATE(S_POLLING),
    FSM_TRANSITION(E_TIMEOUT,          G_IS_LAST_ATTEMPT,    A_POLLING_TERMINATED_NOTIFY, S_IDLE),
    FSM_TRANSITION(E_TIMEOUT,          FSM_OTHERWISE,        A_POLL_SCHEDULE,           S_SLEEP),
    FSM_TRANSITION(E_NETWORK_RX,       FSM_ALWAYS,           A_POLL_SCHEDULE,           S_SLEEP),

    FSM_STATE(S_SLEEP),
    FSM_TRANSITION(E_TIMEOUT,          G_IS_SUBMAN_DATA,     A_SUBMAN_DATA_SEND,        S_POLLING),
    FSM_TRANSITION(E_TIMEOUT,          FSM_OTHERWISE,        A_FRIEND_POLL_SEND,        S_POLLING),
    FSM_TRANSITION(E_FRIEND_UPDATE_RX, G_IS_NOT_ESTABLISHED, A_FRIENDSHIP_ESTABLISHED_NOTIFY, FSM_SAME_STATE),
    FSM_TRANSITION(E_FRIEND_UPDATE_RX, G_IS_NO_MORE_DATA,    A_POLLING_FINISHED_NOTIFY, FSM_SAME_STATE),
    FSM_TRANSITION(E_POLL,             FSM_ALWAYS,           A_POLL_SCHEDULE,           FSM_SAME_STATE),

    FSM_STATE(FSM_ANY_STATE),
    FSM_TRANSITION(E_TERMINATE,        FSM_ALWAYS,           A_FRIEND_CLEAR_SEND,       S_IDLE),
    FSM_TRANSITION(E_INTERNAL_FAULT,   FSM_ALWAYS,           A_FAULT_NOTIFY,            S_IDLE),
};

#if FSM_DEBUG
static const char * m_action_lookup_table[] =
{
    DECLARE_STRING_PAIR(ACTION_LIST)
};

static const char * m_guard_lookup_table[] =
{
    DECLARE_STRING_PAIR(GUARD_LIST)
};

static const char * m_event_lookup_table[] =
{
    DECLARE_STRING(EVENT_LIST)
};

static const char * m_state_lookup_table[] =
{
    DECLARE_STRING(STATE_LIST)
};
#endif  /* FSM_DEBUG */

static const fsm_const_descriptor_t m_lpn_fsm_descriptor =
{
    .transition_table = m_lpn_fsm_transition_table,
    .transitions_count = ARRAY_SIZE(m_lpn_fsm_transition_table),
    .initial_state = S_IDLE,
    .guard = lpn_fsm_guard,
    .action = lpn_fsm_action,
#if FSM_DEBUG
    .fsm_name = "lpn_fsm",
    .action_lookup = m_action_lookup_table,
    .event_lookup = m_event_lookup_table,
    .guard_lookup = m_guard_lookup_table,
    .state_lookup = m_state_lookup_table
#endif  /* FSM_DEBUG */
};

/* Opcode handler */
static const transport_control_packet_handler_t m_incoming_command_handler[2] =
{
    {
        .opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_OFFER,
        .callback = friend_offer_handle
    },
    {
        .opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE,
        .callback = friend_update_handle
    }
};

static fsm_t m_lpn_fsm;
static lpn_t m_lpn;

static const lpn_fsm_action_t lpn_fsm_actions[] =
{
    DECLARE_HANDLER(ACTION_LIST)
};

static const lpn_fsm_guard_t lpn_fsm_guards[] =
{
    DECLARE_HANDLER(GUARD_LIST)
};

static void lpn_fsm_action(fsm_action_id_t action_id, void * p_data)
{
    lpn_fsm_actions[action_id](p_data);
}

static bool lpn_fsm_guard(fsm_guard_id_t guard_id, void * p_data)
{
    return lpn_fsm_guards[guard_id](p_data);
}
/*lint +e123 */

static void a_friend_request_send(void * p_data)
{
    (void) p_data;
    transport_control_packet_t friend_request;
    uint16_t local_address;
    uint16_t local_address_count;
    packet_mesh_trs_control_packet_t control_packet;
    const nrf_mesh_network_secmat_t * p_secmat;

    nrf_mesh_unicast_address_get(&local_address, &local_address_count);
    nrf_mesh_primary_net_secmat_get(local_address, &p_secmat);

