NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/lpn.c
    if (p_secmat == NULL)
    {
        lpn_fault_task_post();
        return;
    }

    friend_request.opcode             = TRANSPORT_CONTROL_OPCODE_FRIEND_REQUEST;
    friend_request.dst.type           = NRF_MESH_ADDRESS_TYPE_GROUP;
    friend_request.dst.value          = NRF_MESH_ALL_FRIENDS_ADDR;
    friend_request.dst.p_virtual_uuid = NULL;
    friend_request.ttl                = 0;
    friend_request.reliable           = false;
    friend_request.src                = local_address;
    friend_request.p_net_secmat       = p_secmat;
    friend_request.p_data             = (const packet_mesh_trs_control_packet_t *)&control_packet;
    friend_request.data_len           = PACKET_MESH_TRS_CONTROL_FRIEND_REQUEST_SIZE;
    friend_request.bearer_selector    = CORE_TX_BEARER_TYPE_LOW_POWER;

    FRIEND_REQUEST_RSSI_FACTOR_PACK(&control_packet, m_lpn.criteria.rssi_factor);
    FRIEND_REQUEST_RX_WINDOW_FACTOR_PACK(&control_packet, m_lpn.criteria.receive_window_factor);
    FRIEND_REQUEST_MIN_QUEUE_SIZE_LOG_PACK(&control_packet, m_lpn.criteria.friend_queue_size_min_log);
    FRIEND_REQUEST_RX_DELAY_PACK(&control_packet, m_lpn.receive_delay_ms);
    FRIEND_REQUEST_POLL_TIMEOUT_PACK(&control_packet,  CEIL_DIV(m_lpn.poll_timeout_ms, 100ul));
    FRIEND_REQUEST_PREVIOUS_ADDRESS_PACK(&control_packet, m_lpn.friend_address);
    FRIEND_REQUEST_NUM_ELEMENTS_PACK(&control_packet,local_address_count);
    FRIEND_REQUEST_LPN_COUNTER_PACK(&control_packet, ++m_lpn.lpn_counter);

    transmit_and_reschedule(&friend_request,
                            NRF_MESH_FRIEND_REQUEST_TOKEN,
                            MESH_LPN_FRIEND_REQUEST_TIMEOUT_MIN_MS,
                            m_lpn.request_timeout_ms);
}

static void a_friend_poll_send(void * p_data)
{
    (void) p_data;
    transport_control_packet_t friend_poll;
    uint16_t local_address;
    uint16_t local_address_count;
    packet_mesh_trs_control_packet_t control_packet;
    const nrf_mesh_network_secmat_t * p_secmat;

    nrf_mesh_unicast_address_get(&local_address, &local_address_count);
    nrf_mesh_friendship_secmat_get(local_address, &p_secmat);

    if (p_secmat == NULL)
    {
        lpn_fault_task_post();
        return;
    }

    friend_poll.opcode             = TRANSPORT_CONTROL_OPCODE_FRIEND_POLL;
    friend_poll.dst.type           = NRF_MESH_ADDRESS_TYPE_UNICAST;
    friend_poll.dst.value          = m_lpn.friend_address;
    friend_poll.dst.p_virtual_uuid = NULL;
    friend_poll.ttl                = 0;
    friend_poll.reliable           = false;
    friend_poll.src                = local_address;
    friend_poll.p_net_secmat       = p_secmat;
    friend_poll.p_data             = (const packet_mesh_trs_control_packet_t *)&control_packet;
    friend_poll.data_len           = PACKET_MESH_TRS_CONTROL_FRIEND_POLL_SIZE;
    friend_poll.bearer_selector    = CORE_TX_BEARER_TYPE_LOW_POWER;

    control_packet.pdu[0] = 0; // set padding to zero
    FRIEND_POLL_FSN_PACK(&control_packet, m_lpn.fsn);

    transmit_and_reschedule(&friend_poll, NRF_MESH_FRIEND_POLL_TOKEN, m_lpn.receive_delay_ms, m_lpn.receive_window_ms);
}

static void a_friend_clear_send(void * p_data)
{
    (void) p_data;
    transport_control_packet_t friend_clear;
    uint16_t local_address;
    uint16_t local_address_count;
    packet_mesh_trs_control_packet_t control_packet;
    const nrf_mesh_network_secmat_t * p_secmat;

    nrf_mesh_unicast_address_get(&local_address, &local_address_count);
    nrf_mesh_friendship_secmat_get(local_address, &p_secmat);

    if (p_secmat == NULL)
    {
        lpn_fault_task_post();
        return;
    }

    friend_clear.opcode             = TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR;
    friend_clear.dst.type           = NRF_MESH_ADDRESS_TYPE_UNICAST;
    friend_clear.dst.value          = m_lpn.friend_address;
    friend_clear.dst.p_virtual_uuid = NULL;
    friend_clear.ttl                = 0;
    friend_clear.reliable           = false;
    friend_clear.src                = local_address;
    friend_clear.p_net_secmat       = p_secmat;
    friend_clear.p_data             = (const packet_mesh_trs_control_packet_t *)&control_packet;
    friend_clear.data_len           = PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE;
    friend_clear.bearer_selector    = CORE_TX_BEARER_TYPE_LOW_POWER;

    FRIEND_CLEAR_LPN_ADDRESS_PACK(&control_packet, local_address);
    FRIEND_CLEAR_LPN_COUNTER_PACK(&control_packet, m_lpn.lpn_counter);

    if (NRF_SUCCESS != transport_control_tx(&friend_clear, NRF_MESH_FRIEND_CLEAR_TOKEN))
    {
        lpn_fault_task_post();
        return;
    }
    scanner_disable();
}

static void a_subman_data_send(void * p_data)
{
    (void) p_data;
    transport_control_packet_t * p_subman_data = m_lpn.p_subman_data;
    uint16_t local_address;
    uint16_t local_address_count;
    const nrf_mesh_network_secmat_t * p_secmat;

    nrf_mesh_unicast_address_get(&local_address, &local_address_count);
    nrf_mesh_friendship_secmat_get(local_address, &p_secmat);

    if (p_secmat == NULL)
    {
        lpn_fault_task_post();
        return;
    }

    p_subman_data->dst.type           = NRF_MESH_ADDRESS_TYPE_UNICAST;
    p_subman_data->dst.value          = m_lpn.friend_address;
    p_subman_data->dst.p_virtual_uuid = NULL;
    p_subman_data->ttl                = 0;
    p_subman_data->reliable           = false;  // there is assumption only unsegmented data is allowed
    p_subman_data->src                = local_address;
    p_subman_data->p_net_secmat       = p_secmat;
    p_subman_data->bearer_selector    = CORE_TX_BEARER_TYPE_LOW_POWER;

    uint32_t token = p_subman_data->opcode == TRANSPORT_CONTROL_OPCODE_FRIEND_SUBSCRIPTION_LIST_ADD ?
            NRF_MESH_SUBMAN_ADD_TOKEN : NRF_MESH_SUBMAN_REMOVE_TOKEN;

    transmit_and_reschedule(p_subman_data, token, m_lpn.receive_delay_ms, m_lpn.receive_window_ms);
}

static void a_friend_search_finished_notify(void * p_data)
{
    (void) p_data;
    nrf_mesh_evt_t evt;

    evt.type = NRF_MESH_EVT_LPN_FRIEND_REQUEST_TIMEOUT;
    event_handle(&evt);
}

static void a_friendship_established_notify(void * p_data)
{
    nrf_mesh_evt_t evt;
    const transport_control_packet_t * p_control_packet =
            ((fsm_transac_data_t *)p_data)->incoming_cmd.p_control_packet;
    nrf_mesh_evt_friendship_established_t * p_establish = &evt.params.friendship_established;

    m_lpn.is_in_friendship = true;

