NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/lpn.c
    // schedule the first poll after friendship establishing
    // entry point to the regular polling
    NRF_MESH_ERROR_CHECK(mesh_lpn_friend_poll(m_lpn.poll_interval_ms));

    evt.type = NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED;
    p_establish->friend_src = p_control_packet->src;
    p_establish->lpn_src = p_control_packet->dst.value;
    event_handle(&evt);
}

static void a_polling_terminated_notify(void * p_data)
{
    (void)p_data;
    nrf_mesh_evt_t evt;

    if (m_lpn.is_in_friendship)
    {
        termination_evt_prepare(&evt, NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_NO_REPLY);
    }
    else
    {
        evt.type = NRF_MESH_EVT_LPN_FRIEND_REQUEST_TIMEOUT;
    }

    event_handle(&evt);
}

static void a_polling_finished_notify(void * p_data)
{
    (void) p_data;
    nrf_mesh_evt_t evt;

    evt.type = NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE;
    event_handle(&evt);

    // lpn fulfilled session with friend completely
    // schedule the next session and go to sleep
    NRF_MESH_ERROR_CHECK(mesh_lpn_friend_poll(m_lpn.poll_interval_ms));
}

static void a_offer_received_notify(void * p_data)
{
    const transport_control_packet_t * p_control_packet =
            ((fsm_transac_data_t *)p_data)->incoming_cmd.p_control_packet;
    const nrf_mesh_rx_metadata_t * p_rx_metadata =
            ((fsm_transac_data_t *)p_data)->incoming_cmd.p_rx_metadata;

    nrf_mesh_evt_t evt;
    nrf_mesh_evt_lpn_friend_offer_t * p_offer = &evt.params.friend_offer;

    evt.type = NRF_MESH_EVT_LPN_FRIEND_OFFER;

    p_offer->src = p_control_packet->src;
    p_offer->p_metadata = p_rx_metadata;
    p_offer->p_net = p_control_packet->p_net_secmat;
    p_offer->offer.friend_counter = FRIEND_OFFER_FRIEND_COUNTER_UNPACK(p_control_packet->p_data);
    p_offer->offer.friend_queue_size = FRIEND_OFFER_QUEUE_SIZE_UNPACK(p_control_packet->p_data);
    p_offer->offer.measured_rssi = FRIEND_OFFER_RSSI_UNPACK(p_control_packet->p_data);
    p_offer->offer.receive_window_ms = FRIEND_OFFER_RX_WINDOW_UNPACK(p_control_packet->p_data);
    p_offer->offer.subscription_list_size = FRIEND_OFFER_SUBLIST_SIZE_UNPACK(p_control_packet->p_data);

    event_handle(&evt);
}

static void a_poll_schedule(void * p_data)
{
    timestamp_t timestamp = timer_now();
    fsm_transac_data_t * p_trasac_data = p_data;

    if (p_data != NULL)
    {
        timestamp += MS_TO_US(p_trasac_data->poll_scheduler.delay_ms);
    }

    m_lpn.timeout_scheduler.cb = timeout_handle;
    timer_sch_reschedule(&m_lpn.timeout_scheduler, timestamp);
}

static void a_fault_notify(void * p_data)
{
    nrf_mesh_evt_t evt;
    termination_evt_prepare(&evt, NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_INTERNAL_TX_FAILED);
    event_handle(&evt);
}

static bool g_is_last_frndreq(void * p_data)
{
    (void)p_data;

    m_lpn.frndreq_attempts_count--;
    return m_lpn.frndreq_attempts_count == 0;
}

static bool g_is_last_attempt(void * p_data)
{
    (void)p_data;

    m_lpn.poll_attempts_count--;
    return m_lpn.poll_attempts_count == 0;
}

static bool g_is_not_established(void * p_data)
{
    (void)p_data;

    return !m_lpn.is_in_friendship;
}

static bool g_is_no_more_data(void * p_data)
{
    const transport_control_packet_t * p_control_packet =
            ((fsm_transac_data_t *)p_data)->incoming_cmd.p_control_packet;
    uint8_t md = FRIEND_UPDATE_MD_UNPACK(p_control_packet->p_data);

    return md == 0;
}

static bool g_is_subman_data(void * p_data)
{
    (void)p_data;

    return m_lpn.p_subman_data != NULL;
}

static bool g_is_offer_suitable(void * p_data)
{
    const transport_control_packet_t * p_control_packet =
            ((fsm_transac_data_t *)p_data)->incoming_cmd.p_control_packet;
    uint8_t rx_window = FRIEND_OFFER_RX_WINDOW_UNPACK(p_control_packet->p_data);

    return rx_window != 0;
}

static void friend_offer_handle(const transport_control_packet_t * p_control_packet,
                                const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    fsm_transac_data_t data =
    {
        .incoming_cmd =
        {
            .p_control_packet = p_control_packet,
            .p_rx_metadata = p_rx_metadata
        }
    };

    fsm_event_post(&m_lpn_fsm, E_FRIEND_OFFER_RX, &data);
}

static void friend_update_handle(const transport_control_packet_t * p_control_packet,
                                 const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    fsm_transac_data_t data =
    {
        .incoming_cmd =
        {
            .p_control_packet = p_control_packet,
            .p_rx_metadata = p_rx_metadata
        }
    };

    nrf_mesh_evt_t evt;
    nrf_mesh_evt_lpn_friend_update_t * p_update = &evt.params.friend_update;

    evt.type = NRF_MESH_EVT_LPN_FRIEND_UPDATE;
    p_update->p_secmat_net = p_control_packet->p_net_secmat;
    p_update->iv_update_active = !!FRIEND_UPDATE_IV_UPDATE_FLAG_UNPACK(p_control_packet->p_data);
    p_update->iv_index = FRIEND_UPDATE_IV_INDEX_UNPACK(p_control_packet->p_data);
    p_update->key_refresh_in_phase2 = !!FRIEND_UPDATE_KEY_REFRESH_FLAG_UNPACK(p_control_packet->p_data);
    p_update->is_friend_queue_empty = !FRIEND_UPDATE_MD_UNPACK(p_control_packet->p_data);
    event_handle(&evt);

    fsm_event_post(&m_lpn_fsm, E_FRIEND_UPDATE_RX, &data);
}

static void receive_delay_handle(timestamp_t timestamp, void * p_context)
{
    (void)timestamp;

    scanner_enable();
    m_lpn.timeout_scheduler.cb = timeout_handle;
    timestamp_t new_timestamp = timer_now() + ((uint32_t) p_context);
    timer_sch_reschedule(&m_lpn.timeout_scheduler, new_timestamp);
}

static void timeout_handle(timestamp_t timestamp, void * p_context)
{
    (void)timestamp;
    (void)p_context;

    scanner_disable();
    fsm_event_post(&m_lpn_fsm, E_TIMEOUT, NULL);
}

static void termination_evt_prepare(nrf_mesh_evt_t * p_evt,
                                    nrf_mesh_evt_friendship_terminated_reason_t reason)
{
    nrf_mesh_evt_friendship_terminated_t * p_terminate = &p_evt->params.friendship_terminated;
    uint16_t local_address;
    uint16_t local_address_count;

    nrf_mesh_unicast_address_get(&local_address, &local_address_count);
    m_lpn.is_in_friendship = false;

    p_evt->type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
    p_terminate->friend_src = m_lpn.friend_address;
    p_terminate->lpn_src = local_address;
    p_terminate->reason = reason;
}

static void transmit_and_reschedule(const transport_control_packet_t * p_packet,
                                    nrf_mesh_tx_token_t token,
                                    uint32_t receive_delay_ms,
                                    uint32_t receive_window_ms)
{
    uint32_t err_code = transport_control_tx(p_packet, token);
    timestamp_t next_timeout = timer_now();
    if (err_code == NRF_SUCCESS)
    {
        next_timeout += MS_TO_US(receive_delay_ms) + TIMER_JITTER_US;
        m_lpn.timeout_scheduler.p_context = (void*) MS_TO_US(receive_window_ms);
        m_lpn.timeout_scheduler.cb = receive_delay_handle;
    }
    else
    {
        __LOG(LOG_SRC_FSM, LOG_LEVEL_DBG1, "LPN transport TX failed (%u)\n", err_code);
        next_timeout += MS_TO_US(receive_delay_ms) + MS_TO_US(receive_window_ms);
        m_lpn.timeout_scheduler.p_context = NULL;
        m_lpn.timeout_scheduler.cb = timeout_handle;
    }

    timer_sch_reschedule(&m_lpn.timeout_scheduler, next_timeout);
}

static void lpn_establish_task(void)
{
    fsm_event_post(&m_lpn_fsm, E_ESTABLISH, NULL);
}

static void lpn_offer_accept_task(void)
{
    fsm_event_post(&m_lpn_fsm, E_OFFER_ACCEPT, NULL);
}

static void lpn_terminate_task(void)
{
    fsm_event_post(&m_lpn_fsm, E_TERMINATE, NULL);

    timer_sch_abort(&m_lpn.timeout_scheduler);

    nrf_mesh_evt_t evt;
    termination_evt_prepare(&evt, NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_LPN);
    event_handle(&evt);
}

static void lpn_poll_task(void)
{
    fsm_transac_data_t data =
    {
        .poll_scheduler.delay_ms = m_lpn.delay_ms
    };

    m_lpn.poll_attempts_count = MESH_LPN_POLL_RETRY_COUNT + 1;
    fsm_event_post(&m_lpn_fsm, E_POLL, &data);
}

static void lpn_fault_task(void)
{
    fsm_event_post(&m_lpn_fsm, E_INTERNAL_FAULT, NULL);
}

static void lpn_fault_task_post(void)
{
    m_lpn.task = lpn_fault_task;
    bearer_event_flag_set(m_lpn.lpn_be_flag);
}

static bool lpn_task_process(void)
{
    NRF_MESH_ASSERT(m_lpn.task != NULL);

    m_lpn.task();

