NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/lpn.c
    return true;
}

static bool is_friendship_secmat(const network_packet_metadata_t * p_net_metadata)
{
    const nrf_mesh_network_secmat_t * p_frnd_secmat = NULL;
    uint16_t local_address;
    uint16_t local_address_count;
    nrf_mesh_unicast_address_get(&local_address, &local_address_count);
    nrf_mesh_friendship_secmat_get(local_address, &p_frnd_secmat);

    return (p_frnd_secmat != NULL &&
            (intptr_t) p_frnd_secmat == (intptr_t) p_net_metadata->p_security_material);
}

/******************************* API *****************************************/
void mesh_lpn_init(void)
{
    fsm_init(&m_lpn_fsm, &m_lpn_fsm_descriptor);

    NRF_MESH_ERROR_CHECK(transport_control_packet_consumer_add(m_incoming_command_handler,
                                                               ARRAY_SIZE(m_incoming_command_handler)));
    mesh_lpn_subman_init();
    m_lpn.friend_address = NRF_MESH_ADDR_UNASSIGNED;
    m_lpn.lpn_be_flag = bearer_event_flag_add(lpn_task_process);
}

uint32_t mesh_lpn_friend_request(mesh_lpn_friend_request_t friend_params,
                                 uint32_t request_timeout_ms)
{
    if (friend_params.friend_criteria.friend_queue_size_min_log == MESH_FRIENDSHIP_MIN_FRIEND_QUEUE_SIZE_PROHIBITED)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (friend_params.receive_delay_ms < MESH_LPN_RECEIVE_DELAY_MIN_MS ||
        friend_params.receive_delay_ms > MESH_LPN_RECEIVE_DELAY_MAX_MS)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (friend_params.poll_timeout_ms > MESH_LPN_POLL_TIMEOUT_MAX_MS ||
        friend_params.poll_timeout_ms < MESH_LPN_POLL_TIMEOUT_MIN_MS ||
        request_timeout_ms > MESH_LPN_FRIEND_REQUEST_TIMEOUT_MAX_MS ||
        request_timeout_ms < MESH_LPN_FRIEND_REQUEST_TIMEOUT_MIN_MS)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (friend_params.poll_timeout_ms <
            (friend_params.receive_delay_ms + MESH_LPN_RECEIVE_DELAY_MAX_MS) * (MESH_LPN_POLL_RETRY_COUNT + 1))
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (mesh_lpn_is_in_friendship() || m_lpn_fsm.current_state != S_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    m_lpn.criteria.friend_queue_size_min_log = friend_params.friend_criteria.friend_queue_size_min_log;
    m_lpn.criteria.receive_window_factor = friend_params.friend_criteria.receive_window_factor;
    m_lpn.criteria.rssi_factor = friend_params.friend_criteria.rssi_factor;
    m_lpn.receive_delay_ms = friend_params.receive_delay_ms;
    m_lpn.poll_timeout_ms = friend_params.poll_timeout_ms;
    m_lpn.request_timeout_ms = request_timeout_ms;
    m_lpn.frndreq_attempts_count = MESH_LPN_FRIEND_REQUEST_RETRY_COUNT + 1;

    m_lpn.task = lpn_establish_task;
    bearer_event_flag_set(m_lpn.lpn_be_flag);

    return NRF_SUCCESS;
}


uint32_t mesh_lpn_friend_accept(const nrf_mesh_evt_lpn_friend_offer_t * p_friend_offer)
{
    if (p_friend_offer == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (mesh_lpn_is_in_friendship() || m_lpn_fsm.current_state != S_ESTABLISHMENT)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    uint16_t local_address;
    uint16_t local_address_count;
    nrf_mesh_unicast_address_get(&local_address, &local_address_count);

    nrf_mesh_keygen_friendship_secmat_params_t sec_params =
    {
        .lpn_address = local_address,
        .friend_address = p_friend_offer->src,
        .lpn_counter = m_lpn.lpn_counter,
        .friend_counter = p_friend_offer->offer.friend_counter
    };
    uint32_t status = nrf_mesh_friendship_secmat_params_set(p_friend_offer->p_net, &sec_params);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    m_lpn.friend_address = p_friend_offer->src;
    m_lpn.receive_window_ms = p_friend_offer->offer.receive_window_ms;
    m_lpn.subscription_list_size = p_friend_offer->offer.subscription_list_size;
    m_lpn.fsn = 0;
    m_lpn.poll_attempts_count = MESH_LPN_POLL_RETRY_COUNT + 1;

    m_lpn.poll_interval_ms = m_lpn.poll_timeout_ms -
            (m_lpn.receive_delay_ms + m_lpn.receive_window_ms) * (MESH_LPN_POLL_RETRY_COUNT + 1);

    m_lpn.task = lpn_offer_accept_task;
    bearer_event_flag_set(m_lpn.lpn_be_flag);

    return NRF_SUCCESS;
}

uint32_t mesh_lpn_friend_poll(uint32_t delay_ms)
{
    if (!mesh_lpn_is_in_friendship())
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (delay_ms > m_lpn.poll_interval_ms)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    m_lpn.delay_ms = delay_ms;
    m_lpn.task = lpn_poll_task;
    bearer_event_flag_set(m_lpn.lpn_be_flag);

    return NRF_SUCCESS;
}

uint32_t mesh_lpn_poll_interval_set(uint32_t poll_interval_ms)
{
    if (!mesh_lpn_is_in_friendship())
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (m_lpn.poll_timeout_ms -
            (m_lpn.receive_delay_ms + m_lpn.receive_window_ms) * (MESH_LPN_POLL_RETRY_COUNT + 1) <
        poll_interval_ms)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    m_lpn.poll_interval_ms = poll_interval_ms;

    return NRF_SUCCESS;
}

uint32_t mesh_lpn_friendship_terminate(void)
{
    if (!mesh_lpn_is_in_friendship())
    {
        return NRF_ERROR_INVALID_STATE;
    }

    m_lpn.task = lpn_terminate_task;
    bearer_event_flag_set(m_lpn.lpn_be_flag);

    return NRF_SUCCESS;
}

bool mesh_lpn_is_in_friendship(void)
{
    return m_lpn.is_in_friendship;
}

void mesh_lpn_rx_notify(const network_packet_metadata_t * p_net_metadata)
{
    if (m_lpn_fsm.current_state == S_IDLE ||
        !is_friendship_secmat(p_net_metadata))
    {
        return;
    }

    scanner_disable();

    if (m_lpn.p_subman_data == NULL)
    {
        m_lpn.fsn++;
    }

    fsm_event_post(&m_lpn_fsm, E_NETWORK_RX, NULL);
}

void mesh_lpn_subman_data_push(transport_control_packet_t * p_trs_ctrl_pkt)
{
    NRF_MESH_ASSERT_DEBUG(p_trs_ctrl_pkt != NULL);
    NRF_MESH_ASSERT_DEBUG(m_lpn.p_subman_data == NULL);

    m_lpn.p_subman_data = p_trs_ctrl_pkt;
    NRF_MESH_ERROR_CHECK(mesh_lpn_friend_poll(0));
}

void mesh_lpn_subman_data_clear(void)
{
    m_lpn.p_subman_data = NULL;
}

#endif /* MESH_FEATURE_LPN_ENABLED */
